 DEFINE FILE(SMPLXMPL)
        GROUP(RESTAPPX)
        DESCRIPTION(Example VSAM KSDS definition)
        ADD(YES) BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES)

 DEFINE PROGRAM(ADDPART) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(ADDPARTC) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(GETPART) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(GETSUPPL) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(PROG1) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(LINK2SUP) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(LINK2SEC) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(LINK2TXN) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE TRANSACTION(JL2L)   GROUP(RESTAPPX)
        PROGRAM(LINK2SUP) TASKDATALOC(ANY)

 DEFINE TRANSACTION(JL2S)   GROUP(RESTAPPX)
        PROGRAM(LINK2SEC) TASKDATALOC(ANY)

 DEFINE TRANSACTION(JL2T)   GROUP(RESTAPPX)
        PROGRAM(LINK2TXN) TASKDATALOC(ANY)
        
 DEFINE TSMODEL(L2LMODEL) GROUP(RESTAPPX)                                   
        DESCRIPTION(Recoverable TS for L2L)                                       
        PREFIX(L2L) LOCATION(AUXILIARY) RECOVERY(YES)      
        SECURITY(NO)                           
