 DEFINE FILE(SMPLXMPL)
        GROUP(RESTAPPX)
        DESCRIPTION(Example VSAM KSDS definition)
        ADD(YES) BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES)

 DEFINE PROGRAM(ADDPART) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(ADDPARTC) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(GETPART) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(GETSUPPL) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(PROG1) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE PROGRAM(SUPPLINK) GROUP(RESTAPPX)
        CONCURRENCY(THREADSAFE) DATALOCATION(ANY)

 DEFINE TRANSACTION(L2LS)   GROUP(RESTAPPX)
        PROGRAM(SUPPLINK) TASKDATALOC(ANY)
